myemacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-02-18 Sat 18:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>My Emacs Configuration</title>
<meta name="author" content="Jiamin Xu" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">My Emacs Configuration</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org6cd9561">1. My Emacs</a>
<ul>
<li><a href="#org5074ea0">1.1. Basic Requirement</a>
<ul>
<li><a href="#org84a3645">1.1.1. General</a></li>
<li><a href="#orgc80043f">1.1.2. Programming modes</a></li>
<li><a href="#org30950cc">1.1.3. Javascript support</a></li>
<li><a href="#org14dafab">1.1.4. C/C++ support</a></li>
<li><a href="#org9430829">1.1.5. Projectile</a></li>
<li><a href="#orgbe30a72">1.1.6. magit</a></li>
<li><a href="#orgd1c5a36">1.1.7. lsp mode - Language Server Protocal Support for Emacs</a></li>
</ul>
</li>
<li><a href="#org43f85fd">1.2. Key Bindings</a></li>
<li><a href="#org8630cfc">1.3. General key bindings for editing</a></li>
<li><a href="#orgb176b67">1.4. Code navigation</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org6cd9561" class="outline-2">
<h2 id="org6cd9561"><span class="section-number-2">1.</span> My Emacs</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org5074ea0" class="outline-3">
<h3 id="org5074ea0"><span class="section-number-3">1.1.</span> Basic Requirement</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>[-]General<code>[0%]</code> 
<ul class="org-ul">
<li>[-]theme
<ul class="org-ul">
<li>[X]gui mode</li>
<li>[X]terminal mode</li>
</ul></li>
<li>[X]modeline</li>
<li>[X]helm</li>
</ul></li>
<li>[-]C/C++ support<code>[0%]</code>
<ul class="org-ul">
<li>[X]auto-complete</li>
<li>[X]goto header file</li>
<li>[X]goto definition</li>
<li>[X]goto declaration</li>
<li>[X]clang-format support</li>
<li>[ ]cmake support</li>
</ul></li>
<li>[ ]Python support</li>
<li>[ ]Javascript support
<ul class="org-ul">
<li>[ ]code navigation</li>
<li>[ ]syntax highlight</li>
<li>[ ]auto complete</li>
</ul></li>
<li>[ ]Vue support</li>
<li>[ ]html support</li>
<li>[ ]gdb support</li>
<li>[ ]git support - magit</li>
<li>[ ]project management</li>
<li>[ ]latex support</li>
<li>[ ]org mode
<ul class="org-ul">
<li>[ ]indent</li>
<li>[ ]preview</li>
<li>[X]plantuml</li>
<li>[ ]fancy highlight of code blocks</li>
</ul></li>
</ul>
</div>

<div id="outline-container-org84a3645" class="outline-4">
<h4 id="org84a3645"><span class="section-number-4">1.1.1.</span> General</h4>
<div class="outline-text-4" id="text-1-1-1">
</div>
<ol class="org-ol">
<li><a id="org7e3f05f"></a>theme<br />
<div class="outline-text-5" id="text-1-1-1-1">
<p>
GUI mode - using doom-themes
Terminal mode - not decided, font/color/background should be repicked
</p>
</div>
</li>
<li><a id="org44a0ad9"></a>mode line<br />
<div class="outline-text-5" id="text-1-1-1-2">
<p>
Powerline package is used, see lisp/init-general.el.
</p>
</div>
</li>
<li><a id="org316ac4e"></a>ace-window<br />
<div class="outline-text-5" id="text-1-1-1-3">
<p>
ace-window is used to switch from window to window.
</p>
</div>
</li>
<li><a id="org84c285c"></a>swiper<br />
<div class="outline-text-5" id="text-1-1-1-4">
<p>
use swiper to do the searching
</p>
</div>
</li>

<li><a id="orgb67ebfb"></a>helm<br /></li>

<li><a id="org3beccaf"></a>neotree<br /></li>

<li><a id="orgffe4ac0"></a>keyfreq<br />
<div class="outline-text-5" id="text-1-1-1-7">
<p>
Keyfreq is used to analyze key using statistics in emacs. 
Include the following lines in your .emacs file:
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #ff79c6;">require</span> '<span style="color: #8be9fd;">keyfreq</span>)
(keyfreq-mode 1)
(keyfreq-autosave-mode 1)

<span style="color: #228b22;">;;</span><span style="color: #228b22;">How to exclude commands?</span>
(<span style="color: #ff79c6;">setq</span> keyfreq-excluded-commands
      '(self-insert-command
        forward-char
        backward-char
        previous-line
        next-line))
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgc80043f" class="outline-4">
<h4 id="orgc80043f"><span class="section-number-4">1.1.2.</span> Programming modes</h4>
</div>



<div id="outline-container-org30950cc" class="outline-4">
<h4 id="org30950cc"><span class="section-number-4">1.1.3.</span> Javascript support</h4>
</div>



<div id="outline-container-org14dafab" class="outline-4">
<h4 id="org14dafab"><span class="section-number-4">1.1.4.</span> C/C++ support</h4>
<div class="outline-text-4" id="text-1-1-4">
</div>
<ol class="org-ol">
<li><a id="org7b044ba"></a>clangd<br />
<div class="outline-text-6" id="text-1-1-4-0-1">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #bd93f9; font-weight: bold;">#include</span> <span style="color: #f1fa8c;">"test.h"</span>


<span style="color: #bd93f9;">int</span> <span style="color: #50fa7b;">main</span>(<span style="color: #bd93f9;">int</span> <span style="color: #ffc9e8;">argc</span>, <span style="color: #bd93f9;">char</span>* <span style="color: #ffc9e8;">argv</span>[])
{


  <span style="color: #ff79c6;">return</span> 0;
}
</pre>
</div>
</div>
</li>

<li><a id="org6e1059a"></a>Semantic(retired)<br />
<div class="outline-text-6" id="text-1-1-4-0-2">
<p>
Now Semantic can search system include path and current path, but it still cannot access all includes in local project. So sometimes auto-complete cannot work. 
Project includes are added into cedet-user-include-dirs to make sure semantics can access all the project includes. 
</p>
</div>
</li>

<li><a id="orgdd5c996"></a>helm-gtags(retired)<br />
<div class="outline-text-6" id="text-1-1-4-0-3">
<p>
gtags works well. I can enjoy code navigation.
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-org9430829" class="outline-4">
<h4 id="org9430829"><span class="section-number-4">1.1.5.</span> Projectile</h4>
<div class="outline-text-4" id="text-1-1-5">
<p>
Here projectile is integrated in helm. 
</p>

<p>
Keybindings:(with C-c p prefix)
C-c p f - helm-projectile-find-file-dwin
</p>
</div>
</div>

<div id="outline-container-orgbe30a72" class="outline-4">
<h4 id="orgbe30a72"><span class="section-number-4">1.1.6.</span> magit</h4>
</div>

<div id="outline-container-orgd1c5a36" class="outline-4">
<h4 id="orgd1c5a36"><span class="section-number-4">1.1.7.</span> lsp mode - Language Server Protocal Support for Emacs</h4>
<div class="outline-text-4" id="text-1-1-7">
<p>
lsp mode = lsp client in editor + language server
</p>
</div>



<ol class="org-ol">
<li><a id="orgfcb2754"></a>Installation<br />
<ol class="org-ol">
<li><a id="org89fe28e"></a>lsp mode<br />
<div class="outline-text-6" id="text-1-1-7-1-1">
<p>
For vanilla Emacs - go minimal and use lsp-mode without external packages
</p>


<p>
packages:
eglot
emacs-ccls
</p>



<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #228b22;">;; </span><span style="color: #228b22;">set prefix for lsp-command-keymap (few alternatives - "C-l", "C-c l")</span>
(setq lsp-keymap-prefix <span style="color: #f1fa8c;">"s-l"</span>)

(use-package lsp-mode
    <span style="color: #ffb86c;">:hook</span> (<span style="color: #228b22;">;; </span><span style="color: #228b22;">replace XXX-mode with concrete major-mode(e. g. python-mode)</span>
           (XXX-mode . lsp)
           <span style="color: #228b22;">;; </span><span style="color: #228b22;">if you want which-key integration</span>
           (lsp-mode . lsp-enable-which-key-integration))
    <span style="color: #ffb86c;">:commands</span> lsp)

<span style="color: #228b22;">;; </span><span style="color: #228b22;">optionally</span>
(use-package lsp-ui 
    <span style="color: #ffb86c;">:commands</span> lsp-ui-mode)
<span style="color: #228b22;">;; </span><span style="color: #228b22;">if you are helm user</span>
(use-package helm-lsp 
    <span style="color: #ffb86c;">:commands</span> helm-lsp-workspace-symbol)
<span style="color: #228b22;">;; </span><span style="color: #228b22;">if you are ivy user</span>
(use-package lsp-ivy 
    <span style="color: #ffb86c;">:commands</span> lsp-ivy-workspace-symbol)
(use-package lsp-treemacs 
    <span style="color: #ffb86c;">:commands</span> lsp-treemacs-errors-list)

<span style="color: #228b22;">;; </span><span style="color: #228b22;">optionally if you want to use debugger</span>
(use-package dap-mode)
<span style="color: #228b22;">;; </span><span style="color: #228b22;">(use-package dap-LANGUAGE) to load the dap adapter for your language</span>

<span style="color: #228b22;">;; </span><span style="color: #228b22;">optional if you want which-key integration</span>
(use-package which-key
    <span style="color: #ffb86c;">:config</span>
    (which-key-mode))

</pre>
</div>
</div>
</li>

<li><a id="org7425791"></a>Dap mode<br /></li>
</ol>
</li>
</ol>
</div>
</div>






<div id="outline-container-org43f85fd" class="outline-3">
<h3 id="org43f85fd"><span class="section-number-3">1.2.</span> Key Bindings</h3>
<div class="outline-text-3" id="text-1-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">key</th>
<th scope="col" class="org-left">function</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">F1</td>
<td class="org-left">open init.el in .emacs.d folder</td>
</tr>

<tr>
<td class="org-left">F2</td>
<td class="org-left">open vterm in other window</td>
</tr>

<tr>
<td class="org-left">F3</td>
<td class="org-left">open neotree</td>
</tr>

<tr>
<td class="org-left">F4</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">F5</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">F6</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">F7</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">F8</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">F9</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">F10</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">F11</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">F12</td>
<td class="org-left">load init.el</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-org8630cfc" class="outline-3">
<h3 id="org8630cfc"><span class="section-number-3">1.3.</span> General key bindings for editing</h3>
<div class="outline-text-3" id="text-1-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">key</th>
<th scope="col" class="org-left">function</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C-x C-f</td>
<td class="org-left">open or new a file</td>
</tr>

<tr>
<td class="org-left">C-x C-s</td>
<td class="org-left">save</td>
</tr>

<tr>
<td class="org-left">C-x C-w</td>
<td class="org-left">save as</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">C-x h</td>
<td class="org-left">select all text</td>
</tr>

<tr>
<td class="org-left">C-a</td>
<td class="org-left">move to the begining of a line</td>
</tr>

<tr>
<td class="org-left">C-e</td>
<td class="org-left">move to the end of a line</td>
</tr>

<tr>
<td class="org-left">C-k</td>
<td class="org-left">kill a line</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgb176b67" class="outline-3">
<h3 id="orgb176b67"><span class="section-number-3">1.4.</span> Code navigation</h3>
<div class="outline-text-3" id="text-1-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">key</th>
<th scope="col" class="org-left">function</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">M-g g</td>
<td class="org-left">go to line</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jiamin Xu</p>
<p class="date">Created: 2023-02-18 Sat 18:21</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
